# PointElementShowNormalPlaneOnly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementShowNormalPlaneOnly Property
ParameterTypeId Class See Also
---
"Show Normal Reference Plane Only"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementShowNormalPlaneOnly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementShowNormalPlaneOnly As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementShowNormalPlaneOnly {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace